astb_relise/src/DataProcessors/АХ_КомплекснаяОбработкаДанных/АХ_КомплекснаяОбработкаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АХ_КомплекснаяОбработкаДанных</name>
</mdclass:DataProcessor>

astb_relise/src/Enums/АХ_СтатусыСборкиТоваров/АХ_СтатусыСборкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АХ_СтатусыСборкиТоваров</name>
  <enumValues>
    <name>ВСборке</name>
  </enumValues>
  <enumValues>
    <name>СборкаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>ПредварительнаяСборка</name>
  </enumValues>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ВыдачаСредствЗащитыСотруднику/ВыдачаСредствЗащитыСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаСредствЗащитыСотруднику</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ЗаявкаНаПроизвольнуюВыдачуСИЗ</basedOn>
  <basedOn>Document.ВыдачаСредствЗащитыСотруднику</basedOn>
  <basedOn>Document.ОбращениеНаСклад</basedOn>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаВыдачу</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>InformationRegister.СрокиНоскиПоУпрощеннойВыдаче</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.СредстваЗащитыКПолучению</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОбращениеНаСклад</types>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
      <types>DocumentRef.ЗаявкаНаПроизвольнуюВыдачуСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛСкладаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_СтатусСборки</name>
    <type>
      <types>EnumRef.АХ_СтатусыСборкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_ПеремещениеПоПредварительнойСборке</name>
    <type>
      <types>DocumentRef.ПеремещениеНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайлМБ7</name>
    <type>
      <types>CatalogRef.ВыдачаСредствЗащитыСотрудникуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещатьВсе</name>
    <comment>Задача 23750</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НеВыдано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыданоПоПричине</name>
      <type>
        <types>CatalogRef.ПричиныНевыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплект</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВКомплекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСовпаденийНоменклатурыНормы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <comment>Максимальная периодичность выдачи для совпадающих значений номенклатуры нормы</comment>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленаКопированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКомплекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ПеремещениеНоменклатуры/ПеремещениеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеНоменклатуры</name>
  <basedOn>Document.ЗаявкаНаВыдачу</basedOn>
  <registerRecords>AccumulationRegister.ЗаявкиНаВыдачу</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.СобственныеСИЗ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МОЛСкладаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛСкладаПолучателя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВыдачу</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/DataProcessors/АХ_КомплекснаяОбработкаДанных/Forms/ФормаСозданияПредварительнойВыдачи/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если Поле.Гиперссылкаячейки Тогда
			СтруктураОткрытия = Новый Структура("Ключ",Элемент.ТекущиеДанные.Ссылка);
			ОткрытьФорму("Документ.ВыдачаСредствЗащитыСотруднику.Форма.ФормаДокумента",СтруктураОткрытия);
		КонецЕсли;
		
	КонецЕСли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокументыВыдачи(Команда)
	
	Если ПроверитьЗаполнение() Тогда 
		ЗаполнитьДокументыВыдачиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредварительнуюВыдачу(Команда)	
	
	Если ПроверитьЗаполнение() Тогда
				
		СтруктураОбработкиОшибок = АХ_ОбменКлиент.ИнициализироватьСтруктуруОбработкиОшибок();				
		СформироватьПредварительнуюВыдачуНаСервере(СтруктураОбработкиОшибок);		
		АХ_ОбменКлиент.РазобратьСтруктуруОбработкиОшибок(СтруктураОбработкиОшибок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьПредварительнуюВыдачуНаСервере(СтруктураОбработкиОшибок)
	
	МассивДокументовВыдачи = ТаблицаДокументов.Выгрузить(,"Ссылка");
	Если МассивДокументовВыдачи.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(нСтр("ru='Нет данных для отправки'", "ru"),,,,СтруктураОбработкиОшибок.ЕстьОшибки);
		Возврат;
	КонецЕсли;

	//при формировании отправки, необходимо проверить корректность документов табличной части, на случай если что то изменяет в документах
	ТаблицаДокументовСОтбором = ПолучитьТаблицуДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТекущихДокументов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ТаблицаТекущихДокументов КАК ТаблицаТекущихДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Ссылка КАК Ссылка
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	НЕ вт.Ссылка В (&МассивДокуметовСОтбором)";
	
	Запрос.УстановитьПараметр("МассивДокуметовСОтбором", ТаблицаДокументовСОтбором.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("ТаблицаТекущихДокументов", ТаблицаДокументов.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ТекстСообщения = нСтр("ru='Документ " + Выборка.Ссылка + " не соответствует отбору '", "ru");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,СтруктураОбработкиОшибок.ЕстьОшибки);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка В(&МассивДокументов)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("МассивДокументов",МассивДокументовВыдачи); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Если МассивДокументовВыдачи.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(нСтр("ru='Нет данных для отправки'", "ru"),,,,СтруктураОбработкиОшибок.ЕстьОшибки);
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Попытка  
			
			НачатьТранзакцию();
			
			// формируем перемещение		
			ДокументПеремещения = Документы.ПеремещениеНоменклатуры.СоздатьДокумент();
			ДокументПеремещения.Дата = ТекущаяДата();
			ДокументПеремещения.Заполнить(Неопределено);
			ДокументПеремещения.Организация = Организация;
			ДокументПеремещения.СкладОтправитель = Склад;
			ДокументПеремещения.МОЛСкладаОтправителя = ПроцедурыРаботыСНормамиСервер.ПолучитьМОЛСклада(ДокументПеремещения.СкладОтправитель,ДокументПеремещения.Организация);
			ДокументПеремещения.СкладПолучатель = Константы.АХ_СкладПредварительнойСборки.Получить();
			ДокументПеремещения.МОЛСкладаПолучателя = ПроцедурыРаботыСНормамиСервер.ПолучитьМОЛСклада(ДокументПеремещения.СкладПолучатель,ДокументПеремещения.Организация);
			
			ДокументПеремещения.Ответственный = Пользователи.ТекущийПользователь();
			ДокументПеремещения.Комментарий   = "ПРЕДВАРИТЕЛЬНАЯ СБОРКА";

			ДокументПеремещения.Товары.Загрузить(РезультатЗапроса.Выгрузить());
			ДокументПеремещения.Записать(РежимЗаписиДокумента.Запись);
			
			Для Каждого СтрокаСДокументом из МассивДокументовВыдачи Цикл
				
				ДокументВыдачи = СтрокаСДокументом.Ссылка;
				// меняем статусы документов, устанавливаем ссылку на перемещение, отменяем проведение
				ОбъектДокументаВыдачи = ДокументВыдачи.ПолучитьОбъект();
				ОбъектДокументаВыдачи.АХ_ПеремещениеПоПредварительнойСборке = ДокументПеремещения.Ссылка;
				ОбъектДокументаВыдачи.АХ_СтатусСборки = Перечисления.АХ_СтатусыСборкиТоваров.Подготовлено;
				ОбъектДокументаВыдачи.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
				
			КонецЦикла;
			
			//проводим перемещение, передаем на склад
			ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);
			
			Соответствие = Новый Соответствие;	
			Соответствие.Вставить("ПланСнятияИПоступление",ДокументПеремещения.Ссылка);
			
			МассивДанных = Новый Массив;
			МассивДанных.Добавить(Соответствие);
			
			АХ_ОбменВызовСервера.ПередатьДанныеВАдресноеХранение(МассивДанных,СтруктураОбработкиОшибок);
			
			Если СтруктураОбработкиОшибок.ЕстьОшибки Тогда
				ОтменитьТранзакцию();
			иначе
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
		Исключение
			
			СтруктураОбработкиОшибок.ЕстьОшибки = Истина;
			ОтменитьТранзакцию();
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Ссылка.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСиз.Персональнаявыдача)
	|	И ВыдачаСредствЗащитыСотруднику.Ссылка.Проведен
	|	И ВыдачаСредствЗащитыСотруднику.Ссылка.АХ_СтатусСборки = ЗНАЧЕНИЕ(Перечисление.АХ_СтатусыСборкиТоваров.ПредварительнаяСборка)
	|	И ВыдачаСредствЗащитыСотруднику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВыдачаСредствЗащитыСотруднику.Склад = &Склад
	|	И ВыдачаСредствЗащитыСотруднику.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаНачала",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Склад",Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДокументыВыдачиНаСервере()
	
	ТаблицаДокументов.Загрузить(ПолучитьТаблицуДокументов());

КонецПроцедуры

#КонецОбласти
